
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

100-student Stata lab perpetual license:
       Serial number:  401506209499
         Licensed to:  mac
                       

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.


running /Applications/Stata15/profile.do ...

   
         =============================================
         
                    Hello World! Hello Stata!

         =============================================

Stata官网： [Stata.com]    [Stata-FAQ]       [Stata-Blogs]    [Stata-资源链接] 

Stata论坛： [Stata-list]   [Stack-Overflow]  [经管之家-人大论坛] 
Stata资源： [Stata连享会-简书]     [Stata连享会-知乎]     [Stata连享会-码云] 
            [Stata书单]            [Stata资源汇总] 
Stata课程： [UCLA在线课程]         [Princeton在线课程] 

Stata现场： [Stata初级班]        [Stata高级班]        [Stata优酷视频] 
学术论文：  [学术搜索]        [CNKI]        [百度学术]          [Super Link] 



   
myQuick:  lec18 | econometric | stata | myda 

. do /Users/mac/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. log using "/Users/mac/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mac/.ipython/stata/log_output.log
  log type:  text
 opened on:  14 Dec 2020, 19:10:49

. sysuse auto,clear
(1978 Automobile Data)

. reg price weight

      Source |       SS           df       MS      Number of obs   =        74
-------------+----------------------------------   F(1, 72)        =     29.42
       Model |   184233937         1   184233937   Prob > F        =    0.0000
    Residual |   450831459        72  6261548.04   R-squared       =    0.2901
-------------+----------------------------------   Adj R-squared   =    0.2802
       Total |   635065396        73  8699525.97   Root MSE        =    2502.3

------------------------------------------------------------------------------
       price |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      weight |      2.044      0.377     5.42   0.000        1.293       2.795
       _cons |     -6.707   1174.430    -0.01   0.995    -2347.890    2334.475
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/mac/.ipython/stata/log_output.log
  log type:  text
 closed on:  14 Dec 2020, 19:10:49
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. 
end of do-file
